Revit 2024 API
EnergyAnalysisConstruction.HeatTransferCoefficient Property
 The heat transfer coefficient value (U-value) of the construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double HeatTransferCoefficient { get; }
Visual Basic
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
Visual C++
public:
property double HeatTransferCoefficient {
	double get ();
}
Remarks
 A heat transfer coefficient measured in W/m^2K
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace